{
  "common": {
    "mindMap": "Sơ đồ tư duy",
    "rootNodeDefaultText": "Nút gốc",
    "secondNodeDefaultText": "Nút cấp hai",
    "branchNodeDefaultText": "Chủ đề nhánh"
  },
  "action": {
    "createMindMap": "Tạo sơ đồ tư duy mới",
    "createMindMapInsertToMd": "Tạo sơ đồ tư duy mới và chèn vào tài liệu hiện tại",
    "openAsMd": "Mở dưới dạng tài liệu Markdown",
    "openAsMindMap": "Mở dưới dạng tài liệu sơ đồ tư duy",
    "changeToOutline": "Chuyển sang chế độ dàn bài",
    "changeToMindMap": "Chuyển sang chế độ sơ đồ tư duy",
    "printOutline": "In dàn bài",
    "import": "Nhập vào",
    "export": "Xuất ra",
    "insertCodeBlockToMd": "Chèn khối mã sơ đồ tư duy vào tài liệu hiện tại",
    "previewAsMindMap": "Xem trước dưới dạng sơ đồ tư duy",
    "changeToReadonly": "Chuyển sang chế độ xem",
    "changeToEdit": "Chuyển sang chế độ chỉnh sửa",
    "changeToMdFile": "Chuyển đổi sang tài liệu Markdown",
    "changeToMindMapFile": "Chuyển đổi sang tài liệu bản đồ tư duy"
  },
  "tip": {
    "tip": "Mẹo",
    "confirm": "Xác nhận",
    "cancel": "Hủy bỏ",
    "close": "Đóng cửa",
    "fileExist": "Tệp đã tồn tại",
    "createMindMapFail": "Tạo sơ đồ tư duy thất bại",
    "fileIsNotMd": "Tệp hiện tại không phải tệp markdown",
    "fileIsEmpty": "Nội dung tệp trống",
    "fileFormatError": "Lỗi định dạng tệp",
    "onlyEnableSelectCurrentVaultFile": "Chỉ cho phép thêm tệp từ kho hiện tại",
    "saving": "Đang lưu...",
    "integerInputError": "Vui lòng nhập số lớn hơn 0",
    "noPreviewImage": "Không có hình ảnh xem trước",
    "insertFail": "Chèn thất bại",
    "noMatchResult": "Không có kết quả phù hợp",
    "fileDeleted": "Tệp đã bị xóa",
    "noPreviewImageInFile": "Không có hình ảnh xem trước trong tệp",
    "pluginNewVersion": "Plugin có phiên bản mới:",
    "pluginNoNewVersion": "Hiện tại là phiên bản mới nhất",
    "pluginVersionCheckError": "Kiểm tra thất bại",
    "changeSuccess": "Hoàn thành chuyển đổi",
    "mdToMindMapFail": "Chuyển đổi thất bại, không có dữ liệu được phân tích để có thể được chuyển đổi thành Bản đồ tư duy",
    "imgCreateFail": "Lỗi tạo tập tin ảnh",
    "mdModifyTip": "Không thay đổi bất kỳ thông tin nào khác ngoài YAML",
    "fileNameEmpty": "Tên tập tin không được để trống",
    "fileNameIllegal": "Tên tập tin chứa ký tự không hợp lệ",
    "fileRenameFail": "Lỗi đổi tên tập tin",
    "mindMapToMdTip": "Sau khi chuyển đổi sang tài liệu Markdown, chỉ một số nội dung sẽ được giữ lại, chẳng hạn như văn bản nút, văn bản tóm tắt, ghi chú, v.v., những nội dung khác sẽ bị loại bỏ và không thể khôi phục, hãy sao lưu trước.",
    "mdToMindMapTip": "Chỉ hỗ trợ chuyển đổi tiêu đề, danh sách và cú pháp khác thành bản đồ tư duy, các nội dung khác sẽ bị loại bỏ và không thể phục hồi, hãy sao lưu trước."
  },
  "setting": {
    "title": {
      "title1": "Cơ bản",
      "title2": "Tệp",
      "title3": "Nén hình ảnh",
      "title4": "Hình ảnh",
      "title5": "Khác",
      "title6": "Hình ảnh hosting"
    },
    "themeMode": {
      "title": "Chế độ chủ đề",
      "desc": "Chế độ tối, ánh sáng",
      "option1": "Theo Obsidian",
      "option2": "Chế độ sáng",
      "option3": "Chế độ tối"
    },
    "theme": {
      "title": "Sắc thái mặc định (màu sáng)",
      "desc": "sắc thái mặc định khi tạo tập tin bản đồ tư duy mới trong chế độ sáng",
      "title2": "sắc thái mặc định (đối)",
      "desc2": "sắc thái mặc định khi tạo tập tin bản đồ tư duy mới trong chế độ tối"
    },
    "layout": {
      "title": "Cấu trúc mặc định",
      "desc": "Cấu trúc mặc định khi tạo tệp sơ đồ tư duy mới"
    },
    "folder": {
      "title4": "Vị trí lưu trữ tệp sơ đồ tư duy",
      "desc4": "Vị trí lưu trữ tệp SimpleMindMap mới tạo",
      "title1": "Thư mục lưu trữ tệp tùy chỉnh",
      "desc1": "Thư mục lưu trữ tệp tùy chỉnh, tương đối với thư mục gốc kho lưu trữ",
      "title5": "Vị trí lưu trữ hình ảnh",
      "desc5": "Vị trí lưu trữ tệp hình ảnh đã tải lên (hình ảnh nút, hình nền)",
      "title2": "Thư mục lưu trữ hình ảnh tùy chỉnh",
      "desc2": "Thư mục lưu trữ hình ảnh tùy chỉnh, tương đối với thư mục gốc kho lưu trữ",
      "title6": "Thư mục con tùy chỉnh",
      "desc6": "Thư mục con tùy chỉnh, tương đối với thư mục chứa tệp hiện tại",
      "title7": "Vị trí lưu trữ tệp",
      "desc7": "Thư mục lưu trữ tệp cục bộ được chọn trong siêu liên kết nút",
      "title3": "Thư mục lưu trữ tệp tùy chỉnh",
      "desc3": "Thư mục lưu trữ tệp tùy chỉnh, tương đối với thư mục gốc kho lưu trữ",
      "option1": "Thư mục gốc của kho lưu trữ",
      "option2": "Thư mục chỉ định",
      "option3": "Thư mục chứa tệp hiện tại",
      "option4": "Thư mục con được chỉ định trong thư mục chứa tệp hiện tại",
      "title8": "Hỗ trợ tìm kiếm OB",
      "desc8": "Tư duy bản đồ dữ liệu là mã hóa nén sau khi lưu trữ, vì vậy không thể tìm kiếm trong ob, nếu bạn muốn trong ob có thể tìm kiếm nội dung văn bản nút của bản đồ tư duy, bạn có thể mở tùy chọn này, sau khi mở sẽ lưu thêm tất cả các nút trong các tập tin nội dung văn bản để tìm kiếm, mang lại tác dụng phụ sẽ dẫn đến khối lượng tập tin lớn hơn, có thể ảnh hưởng đến tốc độ mở và lưu tập tin",
      "title9": "Lưu trữ vị trí canvas và dữ liệu thu phóng",
      "desc9": "Vị trí khung và dữ liệu thu phóng được lưu trong tệp sau khi mở để bạn có thể khôi phục lại vị trí và trạng thái thu phóng của lần đóng cuối cùng khi mở tiếp theo. Nhược điểm là chỉ cần di chuyển và phóng to canvas sẽ làm thay đổi tập tin.",
      "title10": "Mức tối đa của văn bản nút đến tiêu đề Markdown",
      "desc10": "Văn bản nút nhỏ hơn hoặc bằng cấp này được chuyển thành tiêu đề Markdown và phần còn lại được chuyển thành danh sách không có thứ tự."
    },
    "compress": {
      "title1": "Có nén ảnh không",
      "desc1": "Nén ảnh nút đã tải lên (ảnh được chọn cục bộ)",
      "title2": "Chiều rộng tối đa khi nén",
      "desc2": "Thiết lập chiều rộng tối đa sau khi nén ảnh",
      "title3": "Chiều cao tối đa khi nén",
      "desc3": "Thiết lập chiều cao tối đa sau khi nén ảnh",
      "title4": "Chất lượng ảnh",
      "desc4": "Chất lượng sau khi nén hình ảnh, chỉ có hiệu quả đối với một số định dạng hình ảnh, ví dụ như: jpg",
      "curValue": "Giá trị hiện tại",
      "reset": "Đặt lại về mặc định"
    },
    "autoSave": {
      "title": "Thời gian tự động lưu",
      "desc": "Thời gian tự động lưu khi không có thao tác, đơn vị: giây"
    },
    "codeBlock": {
      "title": "Chiều cao ban đầu của khối mã nhúng",
      "desc": "Chiều cao ban đầu khi nhúng bằng khối mã smm, đơn vị: px",
      "title2": "Nền nhúng khối mã có trong suốt hay không",
      "desc2": "Nền có trong suốt khi nhúng khối mã smm hay không, nếu không nó sẽ theo màu nền của chủ đề bản đồ tư duy đã chọn"
    },
    "linkInfo": {
      "issues": "Gửi bug hoặc gợi ý",
      "desktop": "Nhận khách hàng độc lập",
      "community": "Hội đồng"
    },
    "embed": {
      "title1": "Nhúng xem thử Nhấp đúp vào cửa sổ mới để mở",
      "desc1": "![[]] Định dạng Nhấp đúp vào ô xem thử ảnh khi nhúng tài liệu md có cửa sổ mới Mở tập tin không",
      "title2": "Hình nền nhúng xem thử có trong suốt không",
      "desc2": "![[]] Định dạng Nền ảnh được nhúng trong ô xem thử có trong suốt không",
      "title3": "Cho dù hình ảnh nhúng được lưu trữ dưới dạng tệp riêng biệt",
      "desc3": "Hình ảnh được sử dụng mặc định để nhúng xem trước ở định dạng ![[]] được lưu trữ riêng biệt trong kho dưới dạng tệp svg để chỉ đường dẫn tệp được lưu trữ trong tệp Bản đồ Tư duy có thể làm giảm đáng kể khối lượng tệp và tăng tốc độ đọc và lưu tệp. Nếu tắt, dữ liệu hình ảnh sẽ được lưu trữ trong tệp Bản đồ Tư duy và khối lượng sẽ tăng lên đáng kể.",
      "title4": "Nhúng thư mục lưu trữ tập tin ảnh",
      "desc4": "Nhúng xem trước hình ảnh tập tin lưu trữ thư mục, liên quan đến thư mục gốc kho, không nên để trống và thư mục bắt đầu bằng . như một thư mục ẩn",
      "title5": "Trang nhãn mới Mở liên kết nút",
      "desc5": "Nhấp vào liên kết nút được chèn (không chứa liên kết mạng) để mở trên trang tab mới. Bạn cũng có thể mở tab mới bằng Ctrl+chuột trái sau khi đóng"
    },
    "file": {
      "title1": "Định dạng tên tập tin cho bản đồ tư duy mới",
      "desc1": "Dạng thức đặt tên cho tên tệp bản đồ tư duy mới. Hỗ trợ các biến khác ngoài notename",
      "title3": "Định dạng có tên cho ảnh dán",
      "desc3": "Định dạng có tên của ảnh được dán trên nút",
      "filenameFormatDesc": "Mô tả định dạng tên tập tin"
    },
    "font": {
      "title": "Phông chữ",
      "desc": "Phông chữ mặc định khi tạo bản đồ tư duy mới",
      "btn": "Quản lý",
      "placeholder": "Tìm kiếm phông chữ. Bạn cũng có thể nhấn Enter để thêm các phông chữ nhập trực tiếp",
      "empty": "Không có phông chữ",
      "noMatch": "Không tìm thấy phông chữ",
      "noFont": "Không có phông chữ"
    },
    "button": {
      "select": "Chọn"
    },
    "other": {
      "title1": "Kiểm tra phiên bản mới",
      "desc1": "Khi plugin khởi động, bạn sẽ kiểm tra xem có phiên bản mới không và nếu mạng của bạn không truy cập được Github, bạn nên tắt tùy chọn này."
    },
    "imageHosting": {
      "title1": "Mở giường",
      "desc1": "Sau khi mở, tất cả hình ảnh sẽ được tải lên giường.",
      "tip1": "Vui lòng hoàn thiện thông tin cấu hình giường",
      "title2": "Giường Url",
      "desc2": "Điền địa chỉ giao diện tải lên tương ứng với công cụ giường chiếu mà bạn sử dụng",
      "title3": "Trường mẫu",
      "desc3": "Tên trường trong biểu mẫu khi tải lên hình ảnh",
      "title4": "Cấu trúc phản hồi",
      "desc4": "Cấu trúc phản hồi khi tải lên hình ảnh. Hãy tham khảo thêm tại:",
      "desc5": "Hướng dẫn sử dụng giường"
    }
  },
  "html": {
    "filenameFormatDesc": "<p>Ngoài các tên cố định, bạn cũng có thể sử dụng các biến, được đặt trong dấu ngoặc nhọn {}, các biến khả dụng như sau:</p><p>1.{notename}: Tên tệp hiện tại, không bao gồm phần mở rộng;</p><p>2.{date}: Ngày hiện tại, định dạng YYYY-MM-DD;</p><p>3.{time}: Thời gian hiện tại, định dạng HH:mm:ss;</p><p>4.{datatime}: Ngày giờ hiện tại, định dạng: YYYY-MM-DD HH:mm:ss;</p><p>5.{date:Format}: Chỉ định định dạng ngày giờ, ví dụ: MM-DD HH:mm, tham khảo thêm tại: <a href='https://day.js.org/docs/en/parse/string-format'>hướng dẫn định dạng</a>;</p><p>6.{random}: Chuỗi ngẫu nhiên, độ dài 6 ký tự;</p>"
  }
}
